{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "activation": "linear", "name": "conv2d_1", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "batch_input_shape": [null, 64, 64, 3], "strides": [2, 2], "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_2", "padding": "valid", "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_3", "padding": "valid", "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.4, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "dense_1", "units": 1024, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "dense_2", "units": 512, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "name": "dense_3", "units": 1, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null}}]}, "backend": "tensorflow", "keras_version": "2.2.4"}